In [2]:
import pandas as pd
prod_cat_info = pd.read_csv('db\prod_cat_info.csv')
prod_cat_info.head()

   prod_cat_code  prod_cat  prod_sub_cat_code prod_subcat
0              1  Clothing                  4        Mens
1              1  Clothing                  1       Women
2              1  Clothing                  3        Kids
3              2  Footwear                  1        Mens
4              2  Footwear                  3       Women

In [4]:
country_codes = pd.read_csv('db\country_codes.csv', index_col=0)
country_codes.head()

   country
1   Poland
2  Germany
3   France
4    Spain
5    Italy

In [6]:
customers = pd.read_csv('db\customers.csv', index_col=0)
customers.head()

   customer_Id         DOB Gender  country_code
0       268408  02-01-1970      M           4.0
1       269696  07-01-1970      F           8.0
2       268159  08-01-1970      F           8.0
3       270181  10-01-1970      F           2.0
4       268073  11-01-1970      M           1.0

In [19]:
tran_2016 = pd.read_csv(r'db\transactions\transactions-2016.csv', index_col=0).reset_index().drop(columns='index')
tran_2016.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,40303022895,272142,31-12-2016,1,2,5,537,281.925,2966.925,Flagship store
1,47557596721,273764,31-12-2016,8,3,-1,-1037,108.885,-1145.885,Flagship store
2,28966519600,273899,31-12-2016,5,3,1,308,32.340,340.340,e-Shop
3,18110335043,270491,31-12-2016,4,2,1,1343,141.015,1484.015,TeleShop
4,35866122984,269792,31-12-2016,1,2,1,1209,126.945,1335.945,Flagship store

In [22]:
tran_2016.count()

transaction_id      6991
cust_id             6991
tran_date           6991
prod_subcat_code    6991
prod_cat_code       6991
Qty                 6991
Rate                6991
Tax                 6991
total_amt           6991
Store_type          6991
dtype: int64

In [18]:
tran_2017 = pd.read_csv(r'db\transactions\transactions-2017.csv', index_col=0).reset_index().drop(columns='index')
tran_2017.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,26229626485,267624,31-12-2017,1,1,5,1096,575.400,6055.400,Flagship store
1,7576355995,268250,31-12-2017,4,1,5,1409,739.725,7784.725,Flagship store
2,31314199553,274511,31-12-2017,4,4,3,398,125.370,1319.370,e-Shop
3,3931451020,270386,31-12-2017,11,6,3,243,76.545,805.545,e-Shop
4,24878731193,272358,31-12-2017,9,3,4,808,339.360,3571.360,MBR

In [23]:
tran_2017.count()

transaction_id      7541
cust_id             7541
tran_date           7541
prod_subcat_code    7541
prod_cat_code       7541
Qty                 7541
Rate                7541
Tax                 7541
total_amt           7541
Store_type          7541
dtype: int64

In [20]:
tran_2018 = pd.read_csv(r'db\transactions\transactions-2018.csv', index_col=0).reset_index().drop(columns='index')
tran_2018.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,58387181112,275068,31-12-2018,8,3,5,792,415.800,4375.800,e-Shop
1,21300411973,274568,31-12-2018,2,6,1,1054,110.670,1164.670,Flagship store
2,25511948871,273541,31-12-2018,3,1,-3,-253,79.695,-838.695,MBR
3,45524941068,268722,31-12-2018,10,5,5,124,65.100,685.100,Flagship store
4,26100869804,273836,31-12-2018,9,3,3,843,265.545,2794.545,e-Shop

In [24]:
tran_2018.count()

transaction_id      7456
cust_id             7456
tran_date           7456
prod_subcat_code    7456
prod_cat_code       7456
Qty                 7456
Rate                7456
Tax                 7456
total_amt           7456
Store_type          7456
dtype: int64

In [21]:
tran_2019 = pd.read_csv(r'db\transactions\transactions-2019.csv', index_col=0).reset_index().drop(columns='index')
tran_2019.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,80712190438,270351,28-02-2019,1,1,-5,-772,405.300,-4265.300,e-Shop
1,29258453508,270384,27-02-2019,5,3,-5,-1497,785.925,-8270.925,e-Shop
2,51750724947,273420,24-02-2019,6,5,-2,-791,166.110,-1748.110,TeleShop
3,93274880719,271509,24-02-2019,11,6,-3,-1363,429.345,-4518.345,e-Shop
4,51750724947,273420,23-02-2019,6,5,-2,-791,166.110,-1748.110,TeleShop

In [25]:
tran_2019.count()

transaction_id      1065
cust_id             1065
tran_date           1065
prod_subcat_code    1065
prod_cat_code       1065
Qty                 1065
Rate                1065
Tax                 1065
total_amt           1065
Store_type          1065
dtype: int64

In [28]:
class db:
    def __init__(self):
        self.transactions = db.transation_init()
        self.cc = pd.read_csv(r'db\country_codes.csv',index_col=0)
        self.customers = pd.read_csv(r'db\customers.csv',index_col=0)
        self.prod_info = pd.read_csv(r'db\prod_cat_info.csv')

    @staticmethod
    def transation_init():
        transactions = pd.DataFrame()
        src = r'db\transactions'
        for filename in os.listdir(src):
            transactions = transactions.append(pd.read_csv(os.path.join(src,filename),index_col=0))

        def convert_dates(x):
            try:
                return dt.datetime.strptime(x,'%d-%m-%Y')
            except:
                return dt.datetime.strptime(x,'%d/%m/%Y')

        transactions['tran_date'] = transactions['tran_date'].apply(lambda x: convert_dates(x))

        return transactions

transactions.count()

NameError: name 'transactions' is not defined

In [29]:
transactions = pd.concat([tran_2016, tran_2017, tran_2018, tran_2019], axis=0)
transactions.count()

transaction_id      23053
cust_id             23053
tran_date           23053
prod_subcat_code    23053
prod_cat_code       23053
Qty                 23053
Rate                23053
Tax                 23053
total_amt           23053
Store_type          23053
dtype: int64

In [30]:
transactions.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,40303022895,272142,31-12-2016,1,2,5,537,281.925,2966.925,Flagship store
1,47557596721,273764,31-12-2016,8,3,-1,-1037,108.885,-1145.885,Flagship store
2,28966519600,273899,31-12-2016,5,3,1,308,32.340,340.340,e-Shop
3,18110335043,270491,31-12-2016,4,2,1,1343,141.015,1484.015,TeleShop
4,35866122984,269792,31-12-2016,1,2,1,1209,126.945,1335.945,Flagship store

In [33]:
import datetime as dt
transactions['tran_date'] = pd.to_datetime(transactions['tran_date'])
transactions['day_of_week'] = transactions['tran_date'].dt.day_name()
transactions.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type,day_of_week
0,40303022895,272142,2016-12-31,1,2,5,537,281.925,2966.925,Flagship store,Saturday
1,47557596721,273764,2016-12-31,8,3,-1,-1037,108.885,-1145.885,Flagship store,Saturday
2,28966519600,273899,2016-12-31,5,3,1,308,32.340,340.340,e-Shop,Saturday
3,18110335043,270491,2016-12-31,4,2,1,1343,141.015,1484.015,TeleShop,Saturday
4,35866122984,269792,2016-12-31,1,2,1,1209,126.945,1335.945,Flagship store,Saturday

In [35]:
grouped = transactions[transactions['total_amt']>0].groupby(['day_of_week','Store_type'])['total_amt'].sum().round(2)
grouped

day_of_week  Store_type
Friday       Flagship store    1500887.24
             MBR               1608849.06
             TeleShop          1484533.24
             e-Shop            3112438.03
Monday       Flagship store    1494998.70
             MBR               1658793.95
             TeleShop          1578073.70
             e-Shop            3170279.26
Saturday     Flagship store    1507173.59
             MBR               1621743.30
             TeleShop          1430004.81
             e-Shop            3365035.51
Sunday       Flagship store    1531317.84
             MBR               1529706.75
             TeleShop          1594001.18
             e-Shop            3214161.01
Thursday     Flagship store    1624096.95
             MBR               1449457.23
             TeleShop          1520871.17
             e-Shop            3023271.16
Tuesday      Flagship store    1711419.58
             MBR               1572086.81
             TeleShop          1409482.75
             e-Shop            3160432.60
Wednesday    Flagship store    1536725.71
             MBR               1467899.68
             TeleShop          1436151.93
             e-Shop            3139992.31
Name: total_amt, dtype: float64